sysbench/server2/read_only_run_128.log
sysbench 1.0.18 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 128
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 128 tps: 193.05 qps: 3182.01 (r/w/o: 2784.12/0.00/397.89) lat (ms,95%): 816.63 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 128 tps: 204.01 qps: 3270.08 (r/w/o: 2862.46/0.00/407.62) lat (ms,95%): 733.00 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 128 tps: 208.70 qps: 3339.49 (r/w/o: 2921.09/0.00/418.40) lat (ms,95%): 719.92 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 128 tps: 207.70 qps: 3325.27 (r/w/o: 2909.87/0.00/415.40) lat (ms,95%): 719.92 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 128 tps: 206.10 qps: 3301.61 (r/w/o: 2890.31/0.00/411.30) lat (ms,95%): 719.92 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 128 tps: 91.88 qps: 1458.61 (r/w/o: 1275.16/0.00/183.45) lat (ms,95%): 746.32 err/s: 0.00 reconn/s: 0.00
[ 70s ] thds: 128 tps: 49.01 qps: 796.12 (r/w/o: 696.79/0.00/99.33) lat (ms,95%): 13550.80 err/s: 0.00 reconn/s: 0.00
[ 80s ] thds: 128 tps: 197.90 qps: 3153.77 (r/w/o: 2758.68/0.00/395.10) lat (ms,95%): 759.88 err/s: 0.00 reconn/s: 0.00
[ 90s ] thds: 128 tps: 201.70 qps: 3225.86 (r/w/o: 2822.45/0.00/403.41) lat (ms,95%): 759.88 err/s: 0.00 reconn/s: 0.00
[ 100s ] thds: 128 tps: 201.10 qps: 3221.75 (r/w/o: 2819.36/0.00/402.39) lat (ms,95%): 773.68 err/s: 0.00 reconn/s: 0.00
[ 110s ] thds: 128 tps: 203.00 qps: 3246.03 (r/w/o: 2840.72/0.00/405.30) lat (ms,95%): 733.00 err/s: 0.00 reconn/s: 0.00
[ 120s ] thds: 128 tps: 170.59 qps: 2733.11 (r/w/o: 2391.22/0.00/341.89) lat (ms,95%): 893.56 err/s: 0.00 reconn/s: 0.00
[ 130s ] thds: 128 tps: 172.11 qps: 2739.83 (r/w/o: 2396.21/0.00/343.62) lat (ms,95%): 909.80 err/s: 0.00 reconn/s: 0.00
[ 140s ] thds: 128 tps: 185.29 qps: 2978.92 (r/w/o: 2608.33/0.00/370.59) lat (ms,95%): 846.57 err/s: 0.00 reconn/s: 0.00
[ 150s ] thds: 128 tps: 198.70 qps: 3158.54 (r/w/o: 2760.24/0.00/398.31) lat (ms,95%): 773.68 err/s: 0.00 reconn/s: 0.00
[ 160s ] thds: 128 tps: 188.80 qps: 3025.58 (r/w/o: 2648.69/0.00/376.90) lat (ms,95%): 816.63 err/s: 0.00 reconn/s: 0.00
[ 170s ] thds: 128 tps: 200.40 qps: 3223.64 (r/w/o: 2823.33/0.00/400.30) lat (ms,95%): 746.32 err/s: 0.00 reconn/s: 0.00
[ 180s ] thds: 128 tps: 199.99 qps: 3194.80 (r/w/o: 2793.91/0.00/400.89) lat (ms,95%): 759.88 err/s: 0.00 reconn/s: 0.00
[ 190s ] thds: 128 tps: 197.40 qps: 3157.07 (r/w/o: 2762.66/0.00/394.41) lat (ms,95%): 787.74 err/s: 0.00 reconn/s: 0.00
[ 200s ] thds: 128 tps: 187.10 qps: 2996.39 (r/w/o: 2621.09/0.00/375.30) lat (ms,95%): 831.46 err/s: 0.00 reconn/s: 0.00
[ 210s ] thds: 128 tps: 166.90 qps: 2664.13 (r/w/o: 2331.43/0.00/332.70) lat (ms,95%): 1013.60 err/s: 0.00 reconn/s: 0.00
[ 220s ] thds: 128 tps: 188.39 qps: 3012.42 (r/w/o: 2635.73/0.00/376.69) lat (ms,95%): 802.05 err/s: 0.00 reconn/s: 0.00
[ 230s ] thds: 128 tps: 195.80 qps: 3145.01 (r/w/o: 2753.71/0.00/391.30) lat (ms,95%): 759.88 err/s: 0.00 reconn/s: 0.00
[ 240s ] thds: 128 tps: 194.60 qps: 3122.78 (r/w/o: 2732.98/0.00/389.80) lat (ms,95%): 759.88 err/s: 0.00 reconn/s: 0.00
[ 250s ] thds: 128 tps: 191.30 qps: 3057.61 (r/w/o: 2674.31/0.00/383.30) lat (ms,95%): 773.68 err/s: 0.00 reconn/s: 0.00
[ 260s ] thds: 128 tps: 183.60 qps: 2929.31 (r/w/o: 2562.71/0.00/366.60) lat (ms,95%): 816.63 err/s: 0.00 reconn/s: 0.00
[ 270s ] thds: 128 tps: 174.80 qps: 2795.94 (r/w/o: 2446.14/0.00/349.81) lat (ms,95%): 909.80 err/s: 0.00 reconn/s: 0.00
[ 280s ] thds: 128 tps: 182.79 qps: 2921.10 (r/w/o: 2555.81/0.00/365.29) lat (ms,95%): 816.63 err/s: 0.00 reconn/s: 0.00
[ 290s ] thds: 128 tps: 180.90 qps: 2891.13 (r/w/o: 2529.63/0.00/361.50) lat (ms,95%): 816.63 err/s: 0.00 reconn/s: 0.00
[ 300s ] thds: 128 tps: 181.30 qps: 2904.96 (r/w/o: 2542.26/0.00/362.69) lat (ms,95%): 816.63 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            772492
        write:                           0
        other:                           110356
        total:                           882848
    transactions:                        55178  (183.62 per sec.)
    queries:                             882848 (2937.98 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          300.4932s
    total number of events:              55178

Latency (ms):
         min:                                  345.32
         avg:                                  696.59
         max:                                13727.62
         95th percentile:                      816.63
         sum:                             38436252.21

Threads fairness:
    events (avg/stddev):           431.0781/2.30
    execution time (avg/stddev):   300.2832/0.16