sysbench/server2/read_only_run_16.log
sysbench 1.0.18 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 16
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 16 tps: 182.25 qps: 2928.04 (r/w/o: 2562.13/0.00/365.90) lat (ms,95%): 101.13 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 16 tps: 189.20 qps: 3023.54 (r/w/o: 2645.23/0.00/378.30) lat (ms,95%): 97.55 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 16 tps: 190.00 qps: 3046.83 (r/w/o: 2666.63/0.00/380.20) lat (ms,95%): 97.55 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 16 tps: 185.20 qps: 2962.59 (r/w/o: 2592.09/0.00/370.50) lat (ms,95%): 102.97 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 16 tps: 184.30 qps: 2944.02 (r/w/o: 2575.52/0.00/368.50) lat (ms,95%): 102.97 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 16 tps: 188.50 qps: 3019.01 (r/w/o: 2641.91/0.00/377.10) lat (ms,95%): 97.55 err/s: 0.00 reconn/s: 0.00
[ 70s ] thds: 16 tps: 190.50 qps: 3052.05 (r/w/o: 2671.16/0.00/380.89) lat (ms,95%): 97.55 err/s: 0.00 reconn/s: 0.00
[ 80s ] thds: 16 tps: 184.60 qps: 2950.62 (r/w/o: 2581.31/0.00/369.30) lat (ms,95%): 102.97 err/s: 0.00 reconn/s: 0.00
[ 90s ] thds: 16 tps: 186.19 qps: 2977.06 (r/w/o: 2604.68/0.00/372.38) lat (ms,95%): 101.13 err/s: 0.00 reconn/s: 0.00
[ 100s ] thds: 16 tps: 182.61 qps: 2919.86 (r/w/o: 2554.74/0.00/365.12) lat (ms,95%): 108.68 err/s: 0.00 reconn/s: 0.00
[ 110s ] thds: 16 tps: 179.90 qps: 2882.59 (r/w/o: 2522.89/0.00/359.70) lat (ms,95%): 106.75 err/s: 0.00 reconn/s: 0.00
[ 120s ] thds: 16 tps: 188.80 qps: 3019.57 (r/w/o: 2641.98/0.00/377.60) lat (ms,95%): 99.33 err/s: 0.00 reconn/s: 0.00
[ 130s ] thds: 16 tps: 183.70 qps: 2938.71 (r/w/o: 2571.21/0.00/367.50) lat (ms,95%): 106.75 err/s: 0.00 reconn/s: 0.00
[ 140s ] thds: 16 tps: 165.10 qps: 2644.72 (r/w/o: 2314.52/0.00/330.20) lat (ms,95%): 125.52 err/s: 0.00 reconn/s: 0.00
[ 150s ] thds: 16 tps: 184.90 qps: 2956.18 (r/w/o: 2586.49/0.00/369.70) lat (ms,95%): 108.68 err/s: 0.00 reconn/s: 0.00
[ 160s ] thds: 16 tps: 187.00 qps: 2990.50 (r/w/o: 2616.50/0.00/374.00) lat (ms,95%): 101.13 err/s: 0.00 reconn/s: 0.00
[ 170s ] thds: 16 tps: 189.30 qps: 3024.96 (r/w/o: 2646.17/0.00/378.80) lat (ms,95%): 97.55 err/s: 0.00 reconn/s: 0.00
[ 180s ] thds: 16 tps: 190.50 qps: 3050.43 (r/w/o: 2669.53/0.00/380.90) lat (ms,95%): 97.55 err/s: 0.00 reconn/s: 0.00
[ 190s ] thds: 16 tps: 185.60 qps: 2971.97 (r/w/o: 2600.68/0.00/371.30) lat (ms,95%): 104.84 err/s: 0.00 reconn/s: 0.00
[ 200s ] thds: 16 tps: 188.20 qps: 3014.95 (r/w/o: 2638.54/0.00/376.41) lat (ms,95%): 97.55 err/s: 0.00 reconn/s: 0.00
[ 210s ] thds: 16 tps: 188.80 qps: 3013.99 (r/w/o: 2636.49/0.00/377.50) lat (ms,95%): 99.33 err/s: 0.00 reconn/s: 0.00
[ 220s ] thds: 16 tps: 184.20 qps: 2949.88 (r/w/o: 2581.58/0.00/368.30) lat (ms,95%): 102.97 err/s: 0.00 reconn/s: 0.00
[ 230s ] thds: 16 tps: 188.70 qps: 3018.92 (r/w/o: 2641.32/0.00/377.60) lat (ms,95%): 99.33 err/s: 0.00 reconn/s: 0.00
[ 240s ] thds: 16 tps: 181.59 qps: 2908.06 (r/w/o: 2544.87/0.00/363.18) lat (ms,95%): 106.75 err/s: 0.00 reconn/s: 0.00
[ 250s ] thds: 16 tps: 188.21 qps: 3008.71 (r/w/o: 2632.49/0.00/376.21) lat (ms,95%): 101.13 err/s: 0.00 reconn/s: 0.00
[ 260s ] thds: 16 tps: 190.40 qps: 3049.63 (r/w/o: 2668.63/0.00/381.00) lat (ms,95%): 95.81 err/s: 0.00 reconn/s: 0.00
[ 270s ] thds: 16 tps: 180.80 qps: 2892.12 (r/w/o: 2530.52/0.00/361.60) lat (ms,95%): 112.67 err/s: 0.00 reconn/s: 0.00
[ 280s ] thds: 16 tps: 187.80 qps: 2999.99 (r/w/o: 2624.49/0.00/375.50) lat (ms,95%): 99.33 err/s: 0.00 reconn/s: 0.00
[ 290s ] thds: 16 tps: 186.20 qps: 2984.38 (r/w/o: 2611.99/0.00/372.40) lat (ms,95%): 101.13 err/s: 0.00 reconn/s: 0.00
[ 300s ] thds: 16 tps: 179.69 qps: 2874.01 (r/w/o: 2514.52/0.00/359.49) lat (ms,95%): 110.66 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            779016
        write:                           0
        other:                           111288
        total:                           890304
    transactions:                        55644  (185.44 per sec.)
    queries:                             890304 (2966.99 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          300.0672s
    total number of events:              55644

Latency (ms):
         min:                                   32.61
         avg:                                   86.27
         max:                                  178.46
         95th percentile:                      102.97
         sum:                              4800411.29

Threads fairness:
    events (avg/stddev):           3477.7500/5.85
    execution time (avg/stddev):   300.0257/0.02